Revit 2026 API

# IExportContextStart Method

---

This method is called at the very start of the export process, still before the first entity of the model was send out.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
bool Start()
```
```vb
Function Start As Boolean
```
```cpp
bool Start()
```
```fsharp
abstract Start : unit -> bool
```

#### Return Value

Boolean Return True if you are ready to proceed with processing the export.

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace